index.html
<!DOCTYPE html>
<html>
<head>
<title>How To Level Up</title>
<!-- 2013-10-22 Tue 17:54 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<link rel="stylesheet" href="static/style.css" type="text/css">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="number-theory-1.html">Num1</a>
<a href="number-theory-2.html">Num2</a>
<a href="sequences-and-series.html">S&amp;S</a>
<a href="linear-algebra-1.html">LA1</a>
<a href="linear-algebra-2.html">LA2</a>
<a href="calculus.html">C(SV)</a>
<a href="multivariate-calculus-1.html">C(MV)1</a>
<a href="multivariate-calculus-2.html">C(MV)2</a>
</div>
<div id="content">
<h1 class="title">How To Level Up</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Pierre Portal, my first year Calculus/Analysis lecturer, described understanding
mathematics in several levels, from zero to three.
</p>

<ul class="org-ul">
<li>Level Zero: you fell asleep in the lecture, and know nothing.
</li>
<li>Level One: you know the formulas, and can apply them to examples.
</li>
<li>Level Two: you understand the formula, and have an intuition of why it
works. You might be able to extend your knowledge of the formula to a related
use case.
</li>
<li>Level Three: you understand the formula from a mathematical level, and you can
prove it. You might be able to extend your knowledge of the formula to derive
more complicated proofs and properties of mathematical objects you know
about.
</li>
</ul>

<p>
That's the title of this book explained. Introductory mathematics courses might
teach content at Level 1 or Level 2. High achieving high school
mathematics students might wish to understand content at Level 2. But in order
to get to serious concepts in maths, it becomes increasingly necessary to
understand at Level 3. This book is, then, an attempt to help you 'level up'.
</p>

<p>
This book probably won't help you. Pierre is probably totally correct, and you
need to really stare at the problems hard until you just get them. Nevertheless,
this book is an attempt at understanding proof.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Sources</h2>
<div class="outline-text-2" id="text-2">
<p>
For this book I have drawn on a variety of sources, including:
</p>

<ul class="org-ul">
<li>Spivak's "Calculus"
</li>
<li>Trench's "Introduction to Real Analysis"
</li>
<li>Axler's "Linear Algebra Done Right"
</li>
<li>Lay's "Linear Algebra and its Applications"
</li>
<li>Beezer's "A First Course in Linear Algebra"
</li>
<li>Pierre Portal's own Calculus notes for 2013
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
Copyright &copy; 2013 Nathan Yong
</div>
</body>
</html>
